ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28004x_dcsm_bank1_z2_otp_regs.xml
<module id="DCSM_BANK1_Z2_OTP" HW_revision="" description="DCSM BANK1 Z2 OTP Registers">
	<register id="B1_Z2OTP_LINKPOINTER1" width="32" page="1" offset="0x0" internal="0" description="Zone 2 Link Pointer1 in Z2 OTP for flash BANK1">
		<bitfield id="B1_Z2OTP_LINKPOINTER1" description="Zone2 Link Pointer 1 location in USER OTP of Flash BANK1." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B1_Z2OTP_LINKPOINTER2" width="32" page="1" offset="0x4" internal="0" description="Zone 2 Link Pointer2 in Z2 OTP for flash BANK1">
		<bitfield id="B1_Z2OTP_LINKPOINTER2" description="Zone2 Link Pointer 2 location in USER OTP of Flash BANK1." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B1_Z2OTP_LINKPOINTER3" width="32" page="1" offset="0x8" internal="0" description="Zone 2 Link Pointer3 in Z2 OTP for flash BANK1">
		<bitfield id="B1_Z2OTP_LINKPOINTER3" description="Zone2 Link Pointer 3 location in USER OTP of Flash BANK1." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
